In [2]:
import numpy as np
import pandas as pd

In [3]:

d = { 'Ism': ['Ali', 'Laylo', "Bobur", 'Zebo', 'Aziza'],
     'Yosh': [30, 28, 35, 40, 25],
     'Maosh': [5000, 6000, 4000, 7000, 5200],
     'Departament': ['IT', 'Marketing', 'HR', 'IT', 'Marketing']
}

df = pd.DataFrame(d)
df

     Ism  Yosh  Maosh Departament
0    Ali    30   5000          IT
1  Laylo    28   6000   Marketing
2  Bobur    35   4000          HR
3   Zebo    40   7000          IT
4  Aziza    25   5200   Marketing

In [4]:
df.sort_values(by='Yosh')

     Ism  Yosh  Maosh Departament
4  Aziza    25   5200   Marketing
1  Laylo    28   6000   Marketing
0    Ali    30   5000          IT
2  Bobur    35   4000          HR
3   Zebo    40   7000          IT

In [5]:
maosh_5000 = df[df['Maosh']>5000]
maosh_5000

     Ism  Yosh  Maosh Departament
1  Laylo    28   6000   Marketing
3   Zebo    40   7000          IT
4  Aziza    25   5200   Marketing

In [6]:
print(df)
df_g = df.groupby('Departament')['Maosh'].mean()

print(df_g)

     Ism  Yosh  Maosh Departament
0    Ali    30   5000          IT
1  Laylo    28   6000   Marketing
2  Bobur    35   4000          HR
3   Zebo    40   7000          IT
4  Aziza    25   5200   Marketing
Departament
HR           4000.0
IT           6000.0
Marketing    5600.0
Name: Maosh, dtype: float64

In [7]:
baholar = pd.Series(
    [2, 4, 5, 5, 4, 5, 3, 5],
    index=['Ali', 'Vali', 'Avaz', 'Olim', 'Aziz', 'Rano', 'Botir', 'Kamol']
)
baholar

Ali      2
Vali     4
Avaz     5
Olim     5
Aziz     4
Rano     5
Botir    3
Kamol    5
dtype: int64

In [9]:
mean_baholar = baholar.mean()
print(mean_baholar)

4.125

In [10]:
alo_baholar = baholar[baholar>3]
print(alo_baholar)

Vali     4
Avaz     5
Olim     5
Aziz     4
Rano     5
Kamol    5
dtype: int64

In [20]:
data = {'Talaba': ['Ali', 'Vali', 'Aziz', 'Hasan'],
        'Matematika': [78, 85, 90, 65],
        'Adabiyot': [67, 45, 78, 83],
        'Fizika': [70, 90, 75, 90]}

df = pd.DataFrame(data)
print(df)

  Talaba  Matematika  Adabiyot  Fizika
0    Ali          78        67      70
1   Vali          85        45      90
2   Aziz          90        78      75
3  Hasan          65        83      90

In [21]:
df['Umumiy o\'rtacha'] = df[['Matematika', 'Adabiyot', 'Fizika']].mean(axis=1)
df

  Talaba  Matematika  Adabiyot  Fizika  Umumiy o'rtacha
0    Ali          78        67      70        71.666667
1   Vali          85        45      90        73.333333
2   Aziz          90        78      75        81.000000
3  Hasan          65        83      90        79.333333

In [22]:
matematika_80 = df[df['Matematika']>80]
print(matematika_80)

  Talaba  Matematika  Adabiyot  Fizika  Umumiy o'rtacha
1   Vali          85        45      90        73.333333
2   Aziz          90        78      75        81.000000

In [23]:
name_min_fizika = df['Talaba'][df['Fizika'].idxmin()]
print(name_min_fizika)
name_max_fizika = df['Talaba'][df['Fizika'].idxmax()]
print(name_max_fizika)

Ali
Vali

In [26]:
df_men = df[['Adabiyot', 'Matematika', 'Fizika']].mean()
print(df_men)

Adabiyot      68.25
Matematika    79.50
Fizika        81.25
dtype: float64

In [28]:
import pandas as pd

# Ma'lumotlar to'plamini yaratish
data = {
    'Kurs nomi': ['Python', 'Data Science', 'Web Development', 'Machine Learning', 'AI'],
    'Talabalar soni': [50, 35, 40, 25, 30],
    'Narxi (USD)': [150, 200, 180, 250, 300],
    'Davomiyligi (oy)': [3, 4, 5, 6, 6]
}

df = pd.DataFrame(data)
print(df)

          Kurs nomi  Talabalar soni  Narxi (USD)  Davomiyligi (oy)
0            Python              50          150                 3
1      Data Science              35          200                 4
2   Web Development              40          180                 5
3  Machine Learning              25          250                 6
4                AI              30          300                 6

In [29]:
df['Umumiy tushum'] = df['Talabalar soni'] * df['Narxi (USD)']
print(df)

          Kurs nomi  Talabalar soni  Narxi (USD)  Davomiyligi (oy)  \
0            Python              50          150                 3
1      Data Science              35          200                 4
2   Web Development              40          180                 5
3  Machine Learning              25          250                 6
4                AI              30          300                 6

   Umumiy tushum
0           7500
1           7000
2           7200
3           6250
4           9000

In [32]:
kurs_200 = df[df['Narxi (USD)']>200]
print(kurs_200['Kurs nomi'])

3    Machine Learning
4                  AI
Name: Kurs nomi, dtype: object

In [34]:
k_5oy = df[df['Davomiyligi (oy)'] < 5]['Narxi (USD)'].mean()
print(k_5oy)

175.0